# vstGetPt2D

## Description
```pascal
PROCEDURE vstGetPt2D(
				inPtIndex : LONGINT;
				VAR outX  : REAL;
				VAR outY  : REAL;
				result    : BOOLEAN);
```

```python

def vs.vstGetPt2D(inPtIndex, result):
    return (outX, outY)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inPtIndex|LONGINT||
|outX|REAL||
|outY|REAL||
|result|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events